app/Http/Controllers/FrontEndController.php

                'features' => $features,
                'availableLanguages' => $availableLanguages,
                'locale' => $locale,
                'pages' => Pages::where('showAsLink', 1)->get(),
---
select * from `pages` where `showAsLink` = 1