app/Http/Controllers/RestorantController.php

update `users` set `active` = 1, `users`.`updated_at` = '2021-07-21 06:24:36' where `id` = 46
---
    private function __hookMakeRestaurantActive(Restorant $restaurant)
    {
        //Activate the restaurant
        $restaurant->active = 1;
        $restaurant->subdomain = $this->makeAlias($restaurant->name);
        $restaurant->update();

        $owner = $restaurant->user;
        $owner->active = 1;
        $owner->update();